from sympy import *
# ВВОД ВЕКТОРОВ (x - x_r)/x_s + (y - y_r)/y_s + (z - z_r)/z_s
# r = (x_r, y_r, z_r)
# s = (x_s, y_s, z_s)
r1 = (9, -2, -6)
s1 = (-11, -6, 1)
r2 = (1, 3, 4)
s2 = (-5, 4, 1)

# Вектор нормали к обоим прямым
n1 = Matrix([[s1[1], s1[2]], [s2[1], s2[2]]]).det()
n2 = -Matrix([[s1[0], s1[2]], [s2[0], s2[2]]]).det()
n3 = Matrix([[s1[0], s1[1]], [s2[0], s2[1]]]).det()

# Плоскость, проходящая через 1 прямую
print("Плоскость Ax+By+Cz+D=0 через 1 прямую")
A, B, C = n1, n2, n3
D = -(n1*r1[0] + n2*r1[1] + n3*r1[2])
print(A, B, C, D)

print('ОТВЕТ')
# Расстояние от точки 2 прямой до плоскости, проходящей через 1 прямую
r = abs(A*r2[0] + B*r2[1] + C*r2[2] + D) / (A**2 + B**2 + C**2)**0.5
print(r)

