from sympy import *
# ВВОД ВЕКТОРОВ
M1 = (9, 0, 1)
M2 = (2, -5, -7)
M3 = (-9, 2, -4)

# Две прямых в плоскости
s1 = (M1[0] - M2[0], M1[1] - M2[1], M1[2] - M2[2])
s2 = (M1[0] - M3[0], M1[1] - M3[1], M1[2] - M3[2])

# Вектор нормали к плоскости
n1 = Matrix([[s1[1], s1[2]], [s2[1], s2[2]]]).det()
n2 = -Matrix([[s1[0], s1[2]], [s2[0], s2[2]]]).det()
n3 = Matrix([[s1[0], s1[1]], [s2[0], s2[1]]]).det()

# Плоскость, перпендикулярная вектору нормали
print("Плоскость Ax+By+Cz+D=0")
A, B, C = n1, n2, n3
D = -(n1*M1[0] + n2*M1[1] + n3*M1[2])
print(A, B, C, D)

print("Ответ")
print('[', ', '.join(f"{expand(sol)}" for sol in [A, B, C, D]), ']', sep='')