people = {
    '0000011111': 'Пухарев Сергей Валерьевич',          '0001001000': 'Аннин Макар', 
    '0010000010': 'Андреев Александр Алексеевич',       '0010010110': 'Карпов Иван Андреевич', 
    '0010101010': 'Никольский Денис Андреевич',         '0010111011': 'Андриянов Александр Владиславович', 
    '0011000010': 'Мартенс Дмитрий Павлович',           '0011001000': 'Кибенко Эдуард Валерьевич', 
    '0011001010': 'Федченко Максим Владимирович',       '0011011011': 'Никита адаптер Феофанов', 
    '0011100100': 'Костенко Кирилл Денисович',          '0100001000': 'Ямалиева Альбина Азатовна', 
    '0101000010': 'Ямалеева Азалия',                    '0101001010': 'Рекун Ирина Данииловна', 
    '0110000011': 'Арбузина Елена Романовна',           '0110011111': 'Орлова Алёна Александровна', 
    '0111000000': 'Чурилина Полина Олеговна',           '1001010010': 'Матвеев Даниил Алексеевич', 
    '1010000001': 'Левин Кирилл Васильевич',            '1010000011-1': 'Лищук Андрей Викторович', 
    '1010000011-0': 'Чечетка Александр Денисович',      '1010001000': 'Антонович Никита Юрьевич', 
    '10100010101': 'Жданов Арсений Александрович',      '10100010100': 'Вычик Владимир Павлович', 
    '1010011111': 'Егор Тру',                           '1010100010': 'Артём Пантюхов', 
    '1010101010': 'Гаспарян Давид Ваганович',           '1011010010': 'Гращенко Артём Дмитриевич', 
    '1011011111': 'Сакулин Иван Михайлович',            '1011111111': 'Сафронов Иван Сергеевич', 
    '1101100010': 'Калиниченко Анастасия Кирилловна',   '1110011010': 'Азатжонова Мехринисо Азизжон кизи', 
    '1111010000': 'Тер- Степанян Эвелина Сергеевна',    '1111111110': 'Мануковская Дарья Михайловна'
}

questions = [
    'Ваш друг в группе K3121?',
    'Ваш друг - девушка?',
    'Ваш друг совершеннолетний?',
    'Уровень английского A1-B1 ?',
    'Родился в Санкт-Петербурге?',
    'Поступил на бюджет?',
    'Закончил школу с медалью?',
    'Сдал ЕГЭ по математике на балл >= 90?',
    'Сдал ЕГЭ по русскому на балл >= 80?',
    'Сдал ЕГЭ по информатике на балл >= 90?',
    'Ваш друг коллекционировал насекомых?',
    'У вашего друга есть змея?'
]


true_answers = {
    'true', 'истина', 'yes', 'да', '+', '1', 'y', 'д', 't',
    'верно', 'правильно', 'точно', 'ага', 'угу', 
    'плюс', 'определенно', 'определённо', 'несомненно',
    'подлинно', 'истинно', 'правда', 'безусловно',
    'конечно', 'согласен', 'так'
} 
false_answers = {
    'false', 'ложь', 'no', 'нет', '-', '0', 'n', 'н', 'f',
    'неверно', 'неправильно', 'ничуть', 'не', 'неа',
    'минус', 'ничуть', 'неправда', 'ложно', 'чушь',
    'глупость', 'брехня', 'выдумка'
}

