from sympy import *
# ВВОД ВЕКТОРОВ (x - x_r)/x_s + (y - y_r)/y_s + (z - z_r)/z_s
# r = (x_r, y_r, z_r)
# s = (x_s, y_s, z_s)
# r1 = (13, -4, -4)
# s1 = (0, 22, -12)
# r2 = (0, -16, -8)
# s2 = (13, 34, -8)
# r1 = (-14, -3, 11)
# s1 = (0, 2, -24)
# r2 = (6, -6, 7)
# s2 = (-20, 5, -20)
# r1 = (-5, 12, -13)
# s1 = (20, -24, 21)
# r2 = (-4, -16, -18)
# s2 = (19, 4, 26)
# r1 = (-3, -10, -11)
# s1 = (-12, 23, -2)
# r2 = (17, -14, -2)
# s2 = (-32, 27, -11)
# r1 = (-15, -18, -11)
# s1 = (18, 26, 25)
# r2 = (-20, -8, -17)
# s2 = (23, 16, 31)
r1 = (15, -17, -15)
s1 = (-33, 5, 15)
r2 = (-7, 0, -17)
s2 = (-11, -12, 17)

# Вектор нормали к плоскости
n1 = Matrix([[s1[1], s1[2]], [s2[1], s2[2]]]).det()
n2 = -Matrix([[s1[0], s1[2]], [s2[0], s2[2]]]).det()
n3 = Matrix([[s1[0], s1[1]], [s2[0], s2[1]]]).det()

# Плоскость, перпендикулярная вектору нормали
print("Плоскость Ax+By+Cz+D=0")
A, B, C = n1, n2, n3
D = -(n1*r1[0] + n2*r1[1] + n3*r1[2])
print(A, B, C, D)

if abs(A*r2[0] + B*r2[1] + C*r2[2] + D) / (A**2 + B**2 + C**2)**0.5 != 0:
    print("Векторы некомпланарны!")
    exit(1)

print("Ответ")
print('[', ', '.join(f"{expand(sol)}" for sol in [A, B, C, D]), ']', sep='')