name_stations = {'Площадь Александра Невского': 0,
                 'Лиговский проспект': 1,
                 'Владимирская': 2, 'Достоевская': 2,
                 'Невский проспект': 3, 'Гостинный двор': 3,
                 'Садовая': 4, 'Сенная площадь': 4, 'Спасская': 4,
                 'Технологический институт': 5,
                 'Звенигородская': 6, 'Пушкинская': 6,
                 'Маяковская': 7, 'Площадь Восстания': 7}
graph = [[0, 32, 0, 0, 0, 0, 0, 20],
         [32, 0, 11, 0, 0, 0, 0, 0],
         [0, 11, 0, 0, 24, 0, 15, 12],
         [0, 0, 0, 0, 15, 0, 0, 16],
         [0, 0, 24, 15, 0, 15, 20, 0],
         [0, 0, 0, 0, 15, 0, 15, 0],
         [0, 0, 15, 0, 20, 15, 0, 0],
         [20, 0, 12, 16, 0, 0, 0, 0]]


def alg_d(st, end):
    used = [0, 0, 0, 0, 0, 0, 0, 0]
    d = [float('inf') for i in range(8)]
    d[st] = 0
    for i in range(8):
        v = 0
        for j in range(8):
            if not d[i] and (v == 0 or d[j] < d[v]):
                v = j + 0
        if d[v] == float('inf'):
            continue
        used[v] = 1
        for n in range(8):
            if graph[v][n]:
                if d[v] + graph[v][n] < d[n]:
                    d[n] = d[v] + graph[v][n]
    return d[end]

s = input('Откуда?')
e = input('Куда?')
print(alg_d(name_stations[s], name_stations[e]))
