'''
1)Дано целое положительное число n и надо 2 возведения в степень n
2)Без использования ^
3)Без циклов
4)Без рекурсии
5)Не используя ничего, кроме print
'''

n = 5 # int(input())
r = 2**n
print(r)